/*
*********************************************************************************************************
*
*	模块名称 : 系统延时模块
*	文件名称 : bsp_delay.h
*	版    本 : v1.0.00
*	说    明 : 
*
*********************************************************************************************************
*/

#ifndef __BSP_DELAY_H
#define __BSP_DELAY_H

/* 供外部调用函数 */
void bsp_InitDelay(void);
void bsp_DelayUS(uint32_t usNus);
void bsp_DelayMS(uint16_t usNms);

#endif

/****************** (C) COPYRIGHT 2018 ArteryTek *********END OF FILE*********/
